In [1]:
import sqlite3
from sqlite3 import Error
connection = sqlite3.connect('lib2')

cursor = connection.cursor()
cursor.execute(
    '''
    CREATE TABLE Book(
        id INT PRIMARY KEY NOT NULL,
        title TEXT,
        author TEXT,
        publish_year INT
    )
    '''
)

cursor.execute(
    '''
    INSERT INTO Book VALUES
    (1, 'Фрида Кало', 'Хейден Эррера', 2011),
    (2, 'Тонкое искусство пофигизма: Парадоксальный способ жить счастливо', 'Марк Мэнсон', 2016),
    (3, 'The Thorn Birds', 'Colleen Margaretta', 1977)
    '''
)

In [2]:
cursor.execute(
    '''
    CREATE TABLE Reader(
        id INT PRIMARY KEY NOT NULL,
        name TEXT
    )
    '''
)

cursor.execute(
    '''
    INSERT INTO Reader VALUES
    (1, 'Ernest'),
    (2, 'Mark'),
    (3, 'Charles')
    '''
)

In [3]:
cursor.execute(
    '''
    CREATE TABLE Records(
        id INT PRIMARY KEY NOT NULL,
        reader_id INT REFERENCES Readers(id) NOT NULL,
        book_id INT REFERENCES Books(id) NOT NULL,
        taking_date TEXT,
        returning_date TEXT
    )
    '''
)

cursor.execute(
    '''
    INSERT INTO Records VALUES
    (1, 3, 4, '1913-02-16', '1915-05-05'),
    (2, 4, 5, '1999-12-23', 'NULL'),
    (3, 2, 5, '2006-12-11', '2007-05-11'),
    (4, 2, 8, '2006-11-15', '2008-04-16'),
    (5, 2, 4, '2006-05-16', '2007-08-21')
    '''
)

In [4]:
connection.commit()
connection.close()

In [5]:
def book():
    connection = sqlite3.connect("lib2")
    with connection:
        for row in connection.execute("SELECT title FROM Book"):
            print(row)
            
book()

('Фрида Кало',)
('Тонкое искусство пофигизма: Парадоксальный способ жить счастливо',)
('The Thorn Birds',)

In [6]:
def reader():
    connection = sqlite3.connect("lib2")
    with connection:
        for row in connection.execute("SELECT name FROM Reader"):
            print(row)

reader()

('Ernest',)
('Mark',)
('Charles',)

In [7]:
def add_book(book_info):
    connection = sqlite3.connect("lib2")
    with connection:
        connection.execute("INSERT OR IGNORE INTO Book VALUES(?, ?, ?, ?)", book_info)
        connection.commit()

add_book((4, 'Психология влияния', 'Роберт Чалдини', 1984))

проверим теперь список книг

In [8]:
book()

('Фрида Кало',)
('Тонкое искусство пофигизма: Парадоксальный способ жить счастливо',)
('The Thorn Birds',)
('Психология влияния',)

ура, появилась новая книга

книги The Thorn "Birds" и "Фрида Кало" унес читатель и исчез вместе с книгой, спишем книгу

In [9]:
def delete_book(title):
    connection = sqlite3.connect("lib2")
    with connection:
        connection.execute("DELETE FROM Book WHERE title=?", (title,))
        connection.commit()

delete_book('The Thorn Birds')
delete_book('Фрида Кало')

проверим

In [10]:
book()

('Тонкое искусство пофигизма: Парадоксальный способ жить счастливо',)
('Психология влияния',)

In [11]:
def add_reader(reader_info):
    connection = sqlite3.connect("lib2")
    with connection:
        connection.execute("INSERT OR IGNORE INTO Reader VALUES(?, ?)", reader_info)
        connection.commit()

add_reader((4, 'Nastya'))

In [12]:
reader()

('Ernest',)
('Mark',)
('Charles',)
('Nastya',)

In [13]:
def record_selecter():
    connection = sqlite3.connect("lib2")
    with connection:
        for row in connection.execute("SELECT * FROM Records"):
            print(row)
            
record_selecter()

(1, 3, 4, '1913-02-16', '1915-05-05')
(2, 4, 5, '1999-12-23', 'NULL')
(3, 2, 5, '2006-12-11', '2007-05-11')
(4, 2, 8, '2006-11-15', '2008-04-16')
(5, 2, 4, '2006-05-16', '2007-08-21')

In [14]:
def lend_book(record_info):
    connection = sqlite3.connect("lib2")
    with connection:
        connection.execute("INSERT OR IGNORE INTO Records VALUES(?, ?, ?, ?, ?)", record_info)
        connection.commit()
        
lend_book((7, 5, 6, '2022-03-31', '2022-04-07'))

In [15]:
record_selecter()

(1, 3, 4, '1913-02-16', '1915-05-05')
(2, 4, 5, '1999-12-23', 'NULL')
(3, 2, 5, '2006-12-11', '2007-05-11')
(4, 2, 8, '2006-11-15', '2008-04-16')
(5, 2, 4, '2006-05-16', '2007-08-21')
(7, 5, 6, '2022-03-31', '2022-04-07')

In [16]:
def accept_record(record_info):
    connection = sqlite3.connect("lib2")
    with connection:
        connection.execute("INSERT OR IGNORE INTO Records VALUES(?, ?, ?, ?, ?)", record_info)
        connection.commit()
        
accept_record((7, 6, 6, '2022-03-31', 'NULL'))

In [17]:
record_selecter()

(1, 3, 4, '1913-02-16', '1915-05-05')
(2, 4, 5, '1999-12-23', 'NULL')
(3, 2, 5, '2006-12-11', '2007-05-11')
(4, 2, 8, '2006-11-15', '2008-04-16')
(5, 2, 4, '2006-05-16', '2007-08-21')
(7, 5, 6, '2022-03-31', '2022-04-07')